Revit 2026 API

# TopographySurfaceContainsPoint Method

---

Identifies whether the given point exists in the topography surface.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ContainsPoint(
	XYZ point
)
```
```vb
Public Function ContainsPoint (
	point As XYZ
) As Boolean
```
```cpp
public:
bool ContainsPoint(
	XYZ^ point
)
```
```fsharp
member ContainsPoint :
        point : XYZ -> bool
```

#### Parameters

point XYZ
     The point to be checked.

#### Return Value

Boolean True if the input point exists in the topography surface, otherwise false.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The given point will be evaluated in XYZ. If a point matches the XY location, but not the elevation, this function still returns false. This applies to TopographySurface and SiteSubRegion elements.

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace